spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/returns_the_customer_token_for_a_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=10&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_U84nTSdtB1mKPNtbQXYEod6b
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Matthews-MacBook-Pro.local 13.4.0 Darwin Kernel Version 13.4.0: Sun Aug 17
        19:50:11 PDT 2014; root:xnu-2422.115.4~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 20 Nov 2014 05:18:10 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '624'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - f71672f5-d8ec-4b15-96a7-54433990170a
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_150nKYLSkqll2z4UiVjybLQy",
          "livemode": false,
          "created": 1416460690,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_150nKYLSkqll2z4Ui1w3NLc2",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 10,
            "exp_year": 2018,
            "fingerprint": "ScUXMLz4XUWM54rx",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "dynamic_last4": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Thu, 20 Nov 2014 05:18:09 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_150nKYLSkqll2z4UiVjybLQy&plan=base&email=patience_lehner%40dickens.name
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_U84nTSdtB1mKPNtbQXYEod6b
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Matthews-MacBook-Pro.local 13.4.0 Darwin Kernel Version 13.4.0: Sun Aug 17
        19:50:11 PDT 2014; root:xnu-2422.115.4~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '80'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 20 Nov 2014 05:18:11 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2256'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 4416e393-bd26-48c9-9293-13de1851d4c3
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1416460691,
          "id": "cus_5B9dTM436FKjZq",
          "livemode": false,
          "description": null,
          "email": "patience_lehner@dickens.name",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5B9dTM436FKjZq/subscriptions",
            "data": [
              {
                "id": "sub_5B9dSCIdBqt5vt",
                "plan": {
                  "interval": "month",
                  "name": "the base plan",
                  "created": 1415690104,
                  "amount": 999,
                  "currency": "usd",
                  "id": "base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": null
                },
                "object": "subscription",
                "start": 1416460691,
                "status": "active",
                "customer": "cus_5B9dTM436FKjZq",
                "cancel_at_period_end": false,
                "current_period_start": 1416460691,
                "current_period_end": 1419052691,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5B9dTM436FKjZq/cards",
            "data": [
              {
                "id": "card_150nKYLSkqll2z4Ui1w3NLc2",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 10,
                "exp_year": 2018,
                "fingerprint": "ScUXMLz4XUWM54rx",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5B9dTM436FKjZq"
              }
            ]
          },
          "default_card": "card_150nKYLSkqll2z4Ui1w3NLc2"
        }
    http_version: 
  recorded_at: Thu, 20 Nov 2014 05:18:10 GMT
recorded_with: VCR 2.9.3
